app/controllers/activity_controller.rb

SELECT "ontology_classes".* FROM "ontology_classes" WHERE "ontology_classes"."id" = 777 LIMIT 1
---
  def search
    start_point = current_route.start_point   #to calculate distance
    @result = ""

    if !params[:reload].nil? && params[:reload]
      #get activity->getclasses
      classes = session[:current_classes]
      interval = session[:current_interval]
    else
      classes = if params[:class].nil? then [] else params[:class].keys end
      session[:current_classes] = classes
      if !params[:time].nil? then
        start = params[:day].to_i * Interval::DAY + params[:hour].to_i * 60 + params[:min].to_i * 10
        stop = start + params[:duration_hour].to_i * 60 + params[:duration_min].to_i * 10
        @result += "\n:::"+start.to_s+"   "+stop.to_s
        interval = Interval.new(:start => start, :stop => stop)
        @result += "\n:::"+interval.to_s
      end

      session[:current_interval] = interval
    end

    @result += classes.to_s+"<br/>"
    @points = Array.new

    # begin of loop
    classes.each do |cid|
      c = OntologyClass.find_by_id(cid.to_i)

SELECT "ontology_mappings".* FROM "ontology_mappings" WHERE "ontology_mappings"."name" = 'activities2tags' LIMIT 1
SELECT "current_node_tags".* FROM "current_node_tags" WHERE ("current_node_tags".node_id = 618037031)
SELECT "current_node_tags".* FROM "current_node_tags" INNER JOIN "current_nodes_with_tags_mv" ON "current_nodes_with_tags_mv"."id" = current_node_tags.node_id WHERE (("current_nodes_with_tags_mv"."v" LIKE 'college') AND ("current_nodes_with_tags_mv".latitude BETWEEN 530795104 AND 535903885) AND ("current_nodes_with_tags_mv".longitude BETWEEN 86689224 AND 101383438))
---
      area = OSM.sql_for_area(minlat, minlon, maxlat, maxlon,"current_nodes.")

      # get all the points
      om = OntologyMapping.find_by_name("activities2tags")
      for sub in c.descendants.select{|x| x.safe_iconfile!="question-mark.png"} # .select{|x| x.interesting(om)}
        search = om.nodetags_search(sub) # different queries
        if !search.nil?
          field_name = search.first[0]
          val = search.first[1]
          #nts = NodeTag.find(:all, :conditions => "(\"current_node_tags\".\"#{field_name}\" = '#{val}') AND " + area,:include=>"node")
          page = params[:page] ? params[:page] : 0
          nts = NodeTag.find(:all, :limit => 15, :offset => 15* page , :joins => "INNER JOIN \"current_nodes_with_tags_mv\" ON \"current_nodes_with_tags_mv\".\"id\" = current_node_tags.node_id ", :conditions => "(\"current_nodes_with_tags_mv\".\"#{field_name}\" LIKE '#{val}') AND (\"current_nodes_with_tags_mv\".latitude BETWEEN #{(minlat * 10000000).round} AND #{(maxlat * 10000000).round}) AND (\"current_nodes_with_tags_mv\".longitude BETWEEN #{(minlon * 10000000).round} AND #{(maxlon * 10000000).round})")